hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
    DECODE_CALL(buf, msg->dst.call);
    msg->dst.ssidBits = *buf++;
    msg->dst.ssid = (msg->dst.ssidBits >> 1) & 0x0F;
    msg->dst.call[6] = 0;

    DECODE_CALL(buf, msg->src.call);
    msg->src.ssidBits = *buf;
    msg->src.ssid = (msg->src.ssidBits >> 1) & 0x0F;
    msg->src.call[6] = 0;

    for (msg->rpt_count = 0; !(*buf++ & 0x01) && (msg->rpt_count < countof(msg->rpt_list)); msg->rpt_count++) {
        DECODE_CALL(buf, msg->rpt_list[msg->rpt_count].call);
        msg->rpt_list[msg->rpt_count].ssidBits = *buf;
        msg->rpt_list[msg->rpt_count].ssid = (msg->rpt_list[msg->rpt_count].ssidBits >> 1) & 0x0F;
        AX25_SET_REPEATED(msg, msg->rpt_count, (*buf & 0x80));
        msg->rpt_list[msg->rpt_count].call[6] = 0;
    }

    msg->ctrl = *buf++;
    if (msg->ctrl != AX25_CTRL_UI)
        return false; // not a UI frame (corrupted, or legitimate non-APRS AX.25 traffic)

    msg->pid = *buf++;
    if (msg->pid != AX25_PID_NOLAYER3)
        return false; // UI frame but not "no layer 3" - not an APRS frame

    memset(msg->info, 0, sizeof(msg->info));
    int rest = (int)((buf_start + len) - buf);
    if (rest > 0) {
        if (rest > (int)sizeof(msg->info) - 1)
            rest = (int)sizeof(msg->info) - 1;
        msg->len = (size_t)rest;
        /* memcpy, not strncpy: the info field may legally contain any byte */
        memcpy(msg->info, buf, (size_t)rest);
    } else {
        msg->len = 0;
    }
    msg->mVrms = mVrms;
    return true;
}

#ifdef ENABLE_FX25
/**
 * @brief Roll rxBufferHead back after a failed FX.25 parse.
 *
 * Takes the start position as an argument rather than reading it back out of
 * rxFrame[rxFrameHead].start: the handle for a frame in progress is not
 * written until the frame has been validated, so there is nothing to read
 * back, and passing the start position in avoids depending on rxFrameHead not
 * having moved.
 */
static void removeLastFrameFromRxBuffer(uint16_t start) {
    rxBufferHead = start;
}

static void *writeFx25Frame(const uint8_t *data, uint16_t size) {
    /* Worst case: 2 flags, 2 CRC bytes and all the bits added by bitstuffing.
     * Bitstuffing occurs after 5 consecutive ones, so it can occupy up to
     * frame size / 5 additional bytes; +1 for the division remainder. */
    const struct Fx25Mode *fx25Mode = Fx25GetModeForSize(size + 4 + (size / 5) + 1);
    uint16_t requiredSize;
    if (NULL != fx25Mode)
        requiredSize = fx25Mode->K + fx25Mode->T;
    else
        return NULL; /* frame will not fit in FX.25 */

    if (ringByteSpace(txBufferHead, RING_OBSERVE(txBufferTail)) < requiredSize)
        return NULL; /* it may still fit in standard AX.25 */

    txFrame[txFrameHead].size = requiredSize;
    txFrame[txFrameHead].start = txBufferHead;
    txFrame[txFrameHead].fx25Mode = (struct Fx25Mode *)fx25Mode;

    memset(txFx25Buffer, 0, sizeof(txFx25Buffer));

    uint16_t index = 0;
    txFx25Buffer[index++] = 0x7E; /* header flag */

    uint16_t crc = 0xFFFF;
    uint8_t bits = 0;
    uint8_t bitstuff = 0;

    for (uint16_t i = 0; i < size + 2; i++) {
        for (uint8_t k = 0; k < 8; k++) {
            txFx25Buffer[index] >>= 1;
            bits++;
            if (i < size) { /* frame data */
                if ((data[i] >> k) & 1) {
                    calculateCRC(1, &crc);
                    bitstuff++;
                    txFx25Buffer[index] |= 0x80;
                } else {
                    calculateCRC(0, &crc);
                    bitstuff = 0;
                }
            } else { /* crc */
                uint8_t c;
                if (i == size)
                    c = (crc & 0xFF) ^ 0xFF;
                else
                    c = (crc >> 8) ^ 0xFF;

                if ((c >> k) & 1) {
                    bitstuff++;
                    txFx25Buffer[index] |= 0x80;
                } else {
                    bitstuff = 0;
                }
            }

            if (bits == 8) {
                bits = 0;
                index++;
            }
            if (bitstuff == 5) {
                bits++;
                bitstuff = 0;
                txFx25Buffer[index] >>= 1;
                if (bits == 8) {
                    bits = 0;
                    index++;
                }
            }
        }
    }

    /* pad with flags */
    while (index < fx25Mode->K) {
        for (uint8_t k = 0; k < 8; k++) {
            txFx25Buffer[index] >>= 1;
            bits++;

            if ((0x7E >> k) & 1)
                txFx25Buffer[index] |= 0x80;

            if (bits == 8) {
                bits = 0;
                index++;
            }
        }
    }

    Fx25Encode(txFx25Buffer, fx25Mode);

    for (uint16_t i = 0; i < (fx25Mode->K + fx25Mode->T); i++) {
        txBuffer[txBufferHead++] = txFx25Buffer[i];
        txBufferHead %= FRAME_BUFFER_SIZE;
    }

    void *ret = &txFrame[txFrameHead];
    RING_PUBLISH(txFrameHead, RING_NEXT(txFrameHead)); /* payload is in place */
    return ret;
}

static struct FrameHandle *parseFx25Frame(uint8_t *frame, uint16_t size, uint16_t *crc) {
    struct FrameHandle *h = &rxFrame[rxFrameHead];
    uint16_t initialRxBufferHead = rxBufferHead;
    uint8_t tempRxFrameHead = rxFrameHead;

    /* Destuffing writes straight into rxBuffer before the output length is
     * known, so reserve the worst case (`size` bytes, i.e. no stuffing removed)
     * up front. Checking after the fact would be too late. */
    if (!rxRingHasRoom(size))
        return NULL;

    uint16_t i = 0;
    uint16_t k = 0;
    while (frame[i] == 0x7E)
        i++;

    uint8_t bitstuff = 0;
    uint8_t outBit = 0;
    for (; i < size; i++) {
        for (uint8_t b = 0; b < 8; b++) {
            if (frame[i] & (1 << b)) {
                rxBuffer[rxBufferHead] >>= 1;
                rxBuffer[rxBufferHead] |= 0x80;
                bitstuff++;
            } else {
                if (bitstuff == 5) { /* zero after 5 ones: normal bitstuffing */
                    bitstuff = 0;
                    continue;
                } else if (bitstuff == 6) { /* zero after 6 ones: this is a flag */
                    goto endParseFx25Frame;
                } else if (bitstuff >= 7) { /* zero after 7 ones: illegal byte */
                    removeLastFrameFromRxBuffer(initialRxBufferHead);
                    return NULL;
                }
                bitstuff = 0;
                rxBuffer[rxBufferHead] >>= 1;
            }
            outBit++;
            if (outBit == 8) {
                k++;
                rxBufferHead++;
                rxBufferHead %= FRAME_BUFFER_SIZE;
                outBit = 0;
            }
        }
    }

endParseFx25Frame:
    /* k is unsigned: without this, a runt block makes (k - 2) wrap to ~65534
     * and the CRC loop below walks the whole rxBuffer. A valid frame is at
     * least 17 bytes (addresses + control + FCS), same floor the plain HDLC
     * path applies. */
    if (k < 17) {
        removeLastFrameFromRxBuffer(initialRxBufferHead);
        return NULL;
    }

    *crc = 0xFFFF;
    i = initialRxBufferHead;

    for (uint16_t j = 0; j < (k - 2); j++) {
        for (uint8_t b = 0; b < 8; b++)
            calculateCRC((rxBuffer[i] >> b) & 1, crc);

        i++;
        i %= FRAME_BUFFER_SIZE;
    }

    *crc ^= 0xFFFF;
    if ((rxBuffer[i] == (*crc & 0xFF)) && (rxBuffer[(i + 1) % FRAME_BUFFER_SIZE] == ((*crc >> 8) & 0xFF))) {
        uint16_t pathEnd = initialRxBufferHead;
        for (uint16_t j = 0; j < (k - 2); j++) {
            if (rxBuffer[pathEnd] & 1)
                break;
            pathEnd++;
            pathEnd %= FRAME_BUFFER_SIZE;
        }

        if (Ax25Config.allowNonAprs || ((rxBuffer[(pathEnd + 1) % FRAME_BUFFER_SIZE] == 0x03) && (rxBuffer[(pathEnd + 2) % FRAME_BUFFER_SIZE] == 0xF0))) {
            /* The payload is already in rxBuffer at this point. Fill the handle,
             * and only then make it visible - the release store below is what
             * orders both against the consumer on the other core. The caller
             * still writes h->peak/level/corrected/fx25Mode after we return, so
             * publication is deferred to Ax25PublishRxFrame(). */
            h->start = initialRxBufferHead;
            h->size = k - 2;
            (void)tempRxFrameHead; /* rxFrameHead is advanced by publishRxFrame() */
            return h;
        }
    }

    removeLastFrameFromRxBuffer(initialRxBufferHead);
    return NULL;
}

/**
 * @brief Make the handle parseFx25Frame() just filled visible to the consumer.
 *
 * Split out because the FX.25 caller decorates the handle (signal level, FEC
 * byte count, mode) after the parse returns. Publishing here, rather than
 * advancing rxFrameHead inside the parser, keeps the slot invisible to the
 * consumer until those fields have been written.
 */
static void publishRxFrame(void) {
    RING_PUBLISH(rxFrameHead, RING_NEXT(rxFrameHead));
}
#endif /* ENABLE_FX25 */

void *Ax25WriteTxFrame(const uint8_t *data, uint16_t size) {
    /* Consumed by Ax25GetTxBit() in the DAC sample-clock ISR, on another core. */
    if (RING_NEXT(txFrameHead) == RING_OBSERVE(txFrameTail)) {
        ESP_LOGW(TAG, "TX buffer full, frame dropped (%u bytes)", size);
        return NULL;
    }

#ifdef ENABLE_FX25
    if (Ax25Config.fx25 && Ax25Config.fx25Tx) {
        void *ret = writeFx25Frame(data, size);
        if (ret)
            return ret;
    }
#endif

