hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
        /* we're inside "rx->rx != RX_STAGE_FX25_FRAME", so we're not in the middle
         * of an actual FX.25 parity/tag block - safe to check for abort here */
        if ((rx->rawData & 0x7F) == 0x7F) { /* 7 consecutive ones: error */
            rx->rx = RX_STAGE_IDLE;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            rx->crc = 0xFFFF;
            return;
        }
        if ((rx->rawData & 0x3F) == 0x3E) /* dismiss the 0 added by bit stuffing */
            return;
#ifdef ENABLE_FX25
    }
#endif

    if (rx->rawData & 0x01) /* received a 1 */
        rx->receivedByte |= 0x80;

    if (++rx->receivedBitIdx >= 8) { /* received a full byte */
        if (rx->frameIdx >= 2) {
            for (uint8_t k = 0; k < 8; k++)
                calculateCRC((rx->frame[rx->frameIdx - 2] >> k) & 1, &(rx->crc));
        }

#ifdef ENABLE_FX25
        /* end of FX.25 reception, that is, a full block received */
        if ((rx->fx25Mode != NULL) && (rx->frameIdx == (rx->fx25Mode->K + rx->fx25Mode->T))) {
            uint8_t fixed = 0;
            bool fecSuccess = Fx25Decode(rx->frame, rx->fx25Mode, &fixed);
            uint16_t crc;
            struct FrameHandle *h = parseFx25Frame(rx->frame, rx->frameIdx, &crc);
            if (h != NULL) {
                ModemGetSignalLevel(modem, &h->peak, &h->valley, &h->level);
                if (fecSuccess) {
                    h->corrected = fixed;
                    h->fx25Mode = rx->fx25Mode;
                } else {
                    h->corrected = AX25_NOT_FX25;
                }
                h->mVrms = mV; /* was never set on the FX.25 path: the service
                                * task reported whatever the slot held last */
                lastCrc = crc;
                rxMultiplexDelay = 0;
                publishRxFrame(); /* handle complete - now make the slot visible */
            }
            /* on failure parseFx25Frame() already cleaned up the buffer state */
            rx->rx = RX_STAGE_FLAG;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            /* Drop the mode: it is the only thing arming the block-complete test
             * above, and it was left dangling once the block was consumed. A
             * stale pointer here re-arms that test against a plain HDLC frame
             * that happens to reach K+T bytes. */
            rx->fx25Mode = NULL;
            rx->crc = 0xFFFF;
            return;
        }
#else
        rx->rx = RX_STAGE_FRAME;
#endif
        if (rx->frameIdx >= AX25_FRAME_MAX_SIZE) { /* frame too long */
            rx->rx = RX_STAGE_IDLE;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            rx->crc = 0xFFFF;
            return;
        }
        rx->frame[rx->frameIdx++] = rx->receivedByte;
        rx->receivedByte = 0;
        rx->receivedBitIdx = 0;
    } else {
        rx->receivedByte >>= 1;
    }
}

/**
 * @brief DAC-ISR side: retire the frame at txFrameTail and hand its bytes back.
 *
 * Releases exactly the bytes of the frame that actually finished, rather than
 * advancing the byte tail to txBufferHead at the end of the whole
 * transmission: txBufferHead is an index the producer owns, and freeing up to
 * it could release a frame that Ax25WriteTxFrame() has only just written and
 * that has not been sent yet.
 */
static inline void IRAM_ATTR txRetireFrame(void) {
    const struct FrameHandle *h = &txFrame[txFrameTail];
    RING_PUBLISH(txBufferTail, (uint16_t)((h->start + h->size) % FRAME_BUFFER_SIZE));
    RING_PUBLISH(txFrameTail, RING_NEXT(txFrameTail));
    txFramesSentCount++; /* plain store; single writer (this ISR), polled elsewhere */
}

uint8_t IRAM_ATTR Ax25GetTxBit(void) {
    if (txBitIdx == 8) {
        txBitIdx = 0;
        if (txStage == TX_STAGE_PREAMBLE) { /* transmitting the preamble (TXDelay) */
            if (txDelayElapsed < txDelay) {
                txByte = SYNC_BYTE;
                txDelayElapsed++;
            } else {
                txDelayElapsed = 0;
#ifdef ENABLE_FX25
                if (NULL != txFrame[txFrameTail].fx25Mode) {
                    txStage = TX_STAGE_CORRELATION_TAG;
                    txTagByteIdx = 0;
                } else
#endif
                    txStage = TX_STAGE_HEADER_FLAGS;
            }
        }
#ifdef ENABLE_FX25
        if (txStage == TX_STAGE_CORRELATION_TAG) { /* FX.25 correlation tag */
            if (txTagByteIdx < 8)
                txByte = (txFrame[txFrameTail].fx25Mode->tag >> (8 * txTagByteIdx)) & 0xFF;
            else
                txStage = TX_STAGE_DATA;

            txTagByteIdx++;
        }
#endif
        if (txStage == TX_STAGE_HEADER_FLAGS) {
            if (txFlagsElapsed < STATIC_HEADER_FLAG_COUNT) {
                txByte = 0x7E;
                txFlagsElapsed++;
            } else {
                txFlagsElapsed = 0;
                txStage = TX_STAGE_DATA;
            }
        }
        if (txStage == TX_STAGE_DATA) {
            if (txFrameTail != RING_OBSERVE(txFrameHead)) {
                if (txByteIdx < txFrame[txFrameTail].size) {
                    txByte = txBuffer[(txFrame[txFrameTail].start + txByteIdx) % FRAME_BUFFER_SIZE];
                    txByteIdx++;
                }
#ifdef ENABLE_FX25
                else if (txFrame[txFrameTail].fx25Mode != NULL) {
                    txRetireFrame();
                    /* Same one-frame-per-key-up rule as the AX.25 footer-flags
                     * path below: end this key-up here rather than chaining
                     * into whatever is next in the ring (another FX.25 block
                     * or a plain AX.25 frame). Ax25TransmitCheck() will start
                     * a fresh, separately-preambled transmission for it on
                     * its next tick if the ring is still non-empty. */
                    goto transmitTail;
                }
#endif
                else {
                    txStage = TX_STAGE_CRC;
                    txCrcByteIdx = 0;
                }
            } else { /* no more frames */
#ifdef ENABLE_FX25
            transmitTail:
#endif
                txByteIdx = 0;
                txBitIdx = 0;
                txStage = TX_STAGE_TAIL;
            }
        }
        if (txStage == TX_STAGE_CRC) {
            if (txCrcByteIdx <= 1) {
                txByte = (txCrc & 0xFF) ^ 0xFF;
                txCrc >>= 8;
                txCrcByteIdx++;
            } else {
                txCrc = 0xFFFF;
                txStage = TX_STAGE_FOOTER_FLAGS;
                txFlagsElapsed = 0;
            }
        }
        if (txStage == TX_STAGE_FOOTER_FLAGS) {
            if (txFlagsElapsed < STATIC_FOOTER_FLAG_COUNT) {
                txByte = 0x7E;
                txFlagsElapsed++;
            } else {
                txFlagsElapsed = 0;
                txRetireFrame();
                /* Always drop to the tail/PTT-off here instead of chaining
                 * straight into the next queued frame's header. Chaining used
                 * to let several ring-buffered packets go out back-to-back
                 * inside a single uninterrupted key-up (no PTT toggle, no
                 * fresh TXDelay preamble, no per-frame quiet-time/CSMA check
                 * between them), which is why "Packet sent [N buffer(s) still
                 * awaiting]" could report N, N-1, ... 0 within a couple of
                 * TNC2 frame times even though only one PTT ON/OFF pair
                 * bounded the whole burst.
                 *
                 * Ending the key-up here means every frame - including a
                 * second or third one already sitting in the ring - gets its
                 * own transmitStart() (own preamble, own "PTT ON" log line)
                 * once Ax25TransmitCheck() sees the ring still non-empty on
                 * its next tick, so packets go out one at a time with a real
                 * PTT-off in between rather than "at the same time". */
                txByteIdx = 0;
                txBitIdx = 0;
                txStage = TX_STAGE_TAIL;
            }
        }
        if (txStage == TX_STAGE_TAIL) {
            if (txTailElapsed < txTail) {
                txByte = SYNC_BYTE;
                txTailElapsed++;
            } else { /* tail transmitted, stop */
                txTailElapsed = 0;
                txStage = TX_STAGE_IDLE;
                txCrc = 0xFFFF;
                txBitstuff = 0;
                txByte = 0;
                txInitStage = TX_INIT_OFF;
                /* txBufferTail is released per frame by txRetireFrame(); there
                 * is deliberately no bulk reset here any more. */
                ModemTransmitStop();
                txJustKeyedDown = true; /* plain store; polled by Ax25TransmitCheck() */
                return 0;
            }
        }
    }

    uint8_t txBit = 0;
    /* normal data or CRC in AX.25 mode */
    if (
#ifdef ENABLE_FX25
        (NULL == txFrame[txFrameTail].fx25Mode) &&
#endif
        ((txStage == TX_STAGE_DATA) || (txStage == TX_STAGE_CRC))) {
        if (txBitstuff == 5) { /* 5 consecutive ones transmitted */
            txBit = 0;         /* transmit a bit-stuffed 0 */
            txBitstuff = 0;
        } else {
            if (txByte & 1) {
                txBitstuff++;
                txBit = 1;
            } else {
                txBit = 0;
                txBitstuff = 0;
            }
            if (txStage == TX_STAGE_DATA) /* CRC only over normal data */
                calculateCRC(txByte & 1, &txCrc);

