hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
            txByte >>= 1;
            txBitIdx++;
        }
    } else {
        /* FX.25 mode, or AX.25 preamble/flags: no CRC, no bit stuffing */
        txBit = txByte & 1;
        txByte >>= 1;
        txBitIdx++;
    }
    return txBit;
}

void Ax25TransmitBuffer(void) {
    if (txInitStage == TX_INIT_WAITING)
        return;
    if (txInitStage == TX_INIT_TRANSMITTING)
        return;

    if (RING_OBSERVE(txFrameHead) != txFrameTail) {
        /* In full duplex there is no reason to wait at all. */
        txQuiet = millis() + (Ax25Config.fullDuplex ? 0 : Ax25Config.quietTime);
        txInitStage = TX_INIT_WAITING;
    }
}

/**
 * @brief Log "PTT ON" together with the actual content of the frame that is
 * about to key up, decoded back into a readable TNC2 line
 * ("SRC>DST,PATH:info"), instead of a fixed placeholder string.
 *
 * txFrameTail still points at that frame here: transmitStart() runs before
 * the DAC ISR has clocked out a single bit of it, so txRetireFrame() (which
 * advances txFrameTail) has not run yet. Skipped entirely when INFO logging
 * is off for this tag, same as the TX-queued log, so it costs nothing then.
 */
static void logPttOn(void) {
    if (esp_log_level_get(TAG) < ESP_LOG_INFO) {
        return;
    }

    /* Diagnostic: print the ACTUAL measured gap since the last "PTT OFF"
     * against the currently configured minimum, so a log capture proves
     * (or disproves) that the unkey hold was really honored - rather than
     * trusting the gating logic above this function without evidence.
     * Skipped on the very first transmission since boot (txLastUnkeyMillis
     * still 0). */
    if (txLastUnkeyMillis != 0) {
        uint32_t gap = millis() - txLastUnkeyMillis;
        ESP_LOGI(TAG, "unkey gap was %" PRIu32 " ms (configured minimum: %u ms)", gap, (unsigned)Ax25Config.minUnkeyTime);
    }

    const struct FrameHandle *h = &txFrame[txFrameTail];

#ifdef ENABLE_FX25
    if (NULL != h->fx25Mode) {
        /* FX.25-encoded bytes (Reed-Solomon block) are not a plain AX.25
         * frame, so there is nothing meaningful for ax25_decode() to read. */
        ESP_LOGI(TAG, "PTT ON (keyed up)");
        return;
    }
#endif

    uint16_t len = h->size;
    if (len > AX25_FRAME_MAX_SIZE) /* cannot happen; do not overrun if it does */
        len = AX25_FRAME_MAX_SIZE;

    for (uint16_t i = 0; i < len; i++)
        txLogBuffer[i] = txBuffer[(h->start + i) % FRAME_BUFFER_SIZE];

    ax25_msg_t decoded;
    if (ax25_decode(txLogBuffer, len, 0, &decoded)) {
        char tnc2[256];
        modem_format_tnc2(&decoded, tnc2, sizeof(tnc2));
        ESP_LOGI(TAG, "PTT ON (keyed up) - %s", tnc2);
    } else {
        ESP_LOGI(TAG, "PTT ON (keyed up)");
    }
}

/**
 * @brief Start transmission immediately.
 * @warning Transmission must be initialized via Ax25TransmitBuffer().
 */
static void transmitStart(void) {
    txCrc = 0xFFFF;
    txStage = TX_STAGE_PREAMBLE;
    txByte = 0;
    txBitIdx = 0;
    txFlagsElapsed = 0;
    txDelayElapsed = 0;
    ModemTransmitStart();
    logPttOn();
}

/**
 * @brief Poll for TX events raised by the DAC ISR and log them.
 *
 * The ISR (Ax25GetTxBit(), via txRetireFrame() and the TX_STAGE_TAIL
 * completion) only sets plain flags/counters - it must not call ESP_LOGx
 * itself, since that runs far too much code (and can block) to be safe at
 * DAC-sample-clock priority. This runs once per Ax25TransmitCheck() call,
 * which happens every service-task tick in ordinary task context, so it is
 * safe to log from here instead.
 */
static void pollTxEvents(void) {
    static uint32_t lastReportedSentCount = 0;
    uint32_t sent = txFramesSentCount; /* single writer (ISR); safe plain read here */
    while (lastReportedSentCount != sent) {
        lastReportedSentCount++;
        /* Ax25TxFramesPending() here is not the queue depth "PTT OFF"
         * ultimately reports (that is measured once, only when the whole
         * uninterrupted key-up is fully done) - if this frame was one of
         * several chained through the same PTT-on/off cycle (see the "back
         * to normal data" continuation in Ax25GetTxBit(): footer flags for
         * one frame lead straight into the next queued frame's header, with
         * no PTT toggle in between), this is the backlog immediately after
         * *this* buffer specifically, letting a 3-buffer backlog be seen
         * draining 2, 1, 0 across consecutive lines even though only one
         * "PTT ON"/"PTT OFF" pair bounds the whole burst. */
        ESP_LOGI(TAG, "Packet sent [%u buffer(s) still awaiting]", (unsigned)Ax25TxFramesPending());
    }

    if (txJustKeyedDown) {
        txJustKeyedDown = false;
        /* The PTT GPIO is dropped synchronously at key-down, inside the DAC
         * ISR's setTransmit(false) (only the ISR-safe gpio_set_level part; the
         * heavier teardown stays deferred to AFSK_ServiceTx()). txJustKeyedDown
         * is stored right after that pin drop, in the same ISR, so by the time
         * this poll observes it the PTT line is already idle - the log can fire
         * immediately and still sit in step with the real GPIO. This mirrors
         * "PTT ON (keyed up)", which is likewise logged right after setPtt(true)
         * drives the pin active. */
        ESP_LOGI(TAG, "PTT OFF (unkeyed)");

        txLastUnkeyMillis = millis(); /* for the gap print in logPttOn() */
        txReleaseHoldoff = true;      /* hold the next key-up off for one tick */
        if (Ax25Config.minUnkeyTime > 0)
            txMinUnkeyUntil = millis() + Ax25Config.minUnkeyTime;
    }
}

void Ax25TransmitCheck(void) {
    pollTxEvents();

    /* A key-down was just logged this tick: the PTT GPIO was released at
     * key-down (in the DAC ISR) and pollTxEvents() has now emitted "PTT OFF
     * (unkeyed)". Returning here for one tick guarantees the pin stays low
     * long enough to be a real un-key before any queued frame can key up
     * again. AFSK_ServiceTx() runs just before this in the same service tick
     * and clears the pending-teardown flag, so the ModemTxTeardownPending()
     * guard below does not block an immediate re-key on its own; this one-tick
     * holdoff keeps the next frame's transmitStart() -> setPtt(true) from
     * firing microseconds after the "PTT OFF" line. */
    if (txReleaseHoldoff) {
        txReleaseHoldoff = false;
        return;
    }

    /* User-configurable extra unkey hold (Ax25Config.minUnkeyTime, 0 by
     * default): millis() is unsigned and wraps every ~49.7 days, so this
     * comparison uses subtraction rather than a plain "<" against the
     * deadline - (int32_t)(txMinUnkeyUntil - millis()) stays correctly signed
     * across a wraparound, whereas a direct millis() < txMinUnkeyUntil
     * compare would not. */
    if ((int32_t)(txMinUnkeyUntil - millis()) > 0)
        return;

    /* The previous key-up's PTT release happens in AFSK_ServiceTx(), in task
     * context, one modem-service-loop tick after the DAC ISR requests it
     * (setTransmit(false) can only raise a flag from ISR context). Until that
     * teardown has actually run, transmitStart() must not fire again: it
     * calls setTransmit(true), whose side effect of clearing the
     * pending-teardown flag would make AFSK_ServiceTx() skip the PTT release
     * for the frame that just finished entirely - so PTT would stay
     * continuously asserted across what are otherwise two properly separated
     * keyups (own preamble, own PTT-ON log, etc.). Waiting here for one extra
     * tick guarantees a real, visible PTT-off between every frame. */
    if (ModemTxTeardownPending())
        return;

    if (txInitStage == TX_INIT_OFF) {
        /* Nothing keyed up right now. There may still be one or more frames
         * left in the ring though: since each frame now runs its own
         * complete preamble/data/CRC/footer/PTT-off cycle (frames are no
         * longer chained together inside a single key-up - see the
         * TX_STAGE_FOOTER_FLAGS and FX.25 TX_STAGE_DATA-retirement paths in
         * Ax25GetTxBit()), nothing else re-arms txInitStage for the next
         * queued frame on its own. Ax25TransmitBuffer() is a no-op unless
         * txInitStage is TX_INIT_OFF and the ring is non-empty, so it is
         * always safe to call from here every tick. */
        Ax25TransmitBuffer();
        if (txInitStage == TX_INIT_OFF) /* still nothing to transmit */
            return;
    }
    if (txInitStage == TX_INIT_TRANSMITTING) /* already transmitting */
        return;

