hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
    if (txQuiet > millis()) /* quiet time has not elapsed yet */
        return;

    /* Full duplex: the channel state is irrelevant, key up right away.
     * This is also what makes the GPIO ADC -> GPIO DAC loop work: the DCD is
     * permanently asserted by our own carrier, so a CSMA node would never
     * transmit a second frame. */
    if (Ax25Config.fullDuplex) {
        txInitStage = TX_INIT_TRANSMITTING;
        txRetries = 0;
        transmitStart();
        return;
    }

    if (ModemDcdState()) {
        /* Channel busy: re-poll DCD every slot time rather than transmitting
         * through it. txRetries counts these busy slots purely as an
         * anti-starvation floor - a channel that never clears within
         * MAX_TRANSMIT_RETRY_COUNT slots forces a transmission anyway rather
         * than holding a queued frame forever. */
        if (txRetries >= MAX_TRANSMIT_RETRY_COUNT) {
            ESP_LOGI(TAG, "Channel busy after %u slots, transmitting anyway", txRetries);
            txInitStage = TX_INIT_TRANSMITTING;
            txRetries = 0;
            transmitStart();
        } else {
            txQuiet = millis() + Ax25Config.csmaSlotTime;
            txRetries++;
        }
        return;
    }

    /* Channel is clear: standard AX.25/KISS p-persistent access. Roll the
     * dice with probability Ax25Config.persist / 256 of keying up on this
     * slot; on a miss, wait one more slot time and re-poll DCD before
     * rolling again, rather than keying up unconditionally the instant DCD
     * drops. */
    if (esp_random() % 256 < Ax25Config.persist) {
        txInitStage = TX_INIT_TRANSMITTING;
        txRetries = 0;
        transmitStart();
        return;
    }

    txQuiet = millis() + Ax25Config.csmaSlotTime;
    txRetries++;
    if (txRetries >= MAX_TRANSMIT_RETRY_COUNT) {
        /* Anti-starvation floor: the persistence roll keeps missing on an
         * otherwise-clear channel (bad luck, or Ax25Config.persist tuned very
         * low) - force the transmission rather than let the frame wait
         * indefinitely. */
        ESP_LOGI(TAG, "Persistence check missed %u times on a clear channel, transmitting anyway", txRetries);
        txInitStage = TX_INIT_TRANSMITTING;
        txRetries = 0;
        transmitStart();
    }
}

void Ax25Init(uint8_t fx25Mode) {
    txCrc = 0xFFFF;
    uint8_t fullDuplex = Ax25Config.fullDuplex; /* preserve across re-init */
    memset(&Ax25Config, 0, sizeof(Ax25Config));
    Ax25Config.fullDuplex = fullDuplex;
    Ax25Config.quietTime = 2000;
    Ax25Config.txDelayLength = 300;
    Ax25Config.txTailLength = 1;
    Ax25Config.csmaSlotTime = 100; /* 100 ms/slot, the common AX.25 SlotTime default */
    Ax25Config.persist = 63;       /* ~25% transmit chance per clear slot, the common AX.25 Persist default */

    if (fx25Mode == 0) {
        Ax25Config.fx25 = 0;
        Ax25Config.fx25Tx = 0;
    } else if (fx25Mode == 1) {
        Ax25Config.fx25 = 1;
        Ax25Config.fx25Tx = 0;
    } else {
        Ax25Config.fx25 = 1;
        Ax25Config.fx25Tx = 1;
    }

    memset(rxState, 0, sizeof(rxState));
    for (uint8_t i = 0; i < countof(rxState); i++)
        rxState[i].crc = 0xFFFF;

    rxBufferHead = 0;
    rxBufferTail = 0;
    rxFrameHead = 0;
    rxFrameTail = 0;
    rxMultiplexDelay = 0;
    txBufferHead = 0;
    txBufferTail = 0;
    txFrameHead = 0;
    txFrameTail = 0;
    txBitIdx = 8; /* force a stage evaluation on the very first Ax25GetTxBit() */
    txStage = TX_STAGE_IDLE;
    lastCrc = 0;

    /* milliseconds -> byte count */
    txDelay = (uint16_t)((float)Ax25Config.txDelayLength / (8.f * 1000.f / ModemGetBaudrate()));
    txTail = (uint16_t)((float)Ax25Config.txTailLength / (8.f * 1000.f / ModemGetBaudrate()));
    txInitStage = TX_INIT_OFF;
    txQuiet = millis() + Ax25Config.quietTime + randomRange(10, 200);
}

void Ax25TxDelay(uint16_t delay_ms) {
    Ax25Config.txDelayLength = delay_ms;
    txDelay = (uint16_t)((float)Ax25Config.txDelayLength / (8.f * 1000.f / ModemGetBaudrate()));
}

void Ax25TimeSlot(uint16_t ts) {
    if (ts > 0) {
        Ax25Config.quietTime = ts;
        txQuiet = millis() + Ax25Config.quietTime + randomRange(100, 1000);
    } else {
        txQuiet = 0;
    }
}

void Ax25MinUnkeyTime(uint16_t ms) {
    Ax25Config.minUnkeyTime = ms;
}

/* ====================================================================== */
/*  TNC2 <-> AX.25 helpers                                                */
/* ====================================================================== */

static unsigned int strpos(const char *txt, char chk) {
    const char *pch = strchr(txt, chk);
    if (pch == NULL)
        return 0;
    return (unsigned int)(pch - txt);
}

static void convPath(ax25_header_t *hdr, const char *txt, unsigned int size) {
    unsigned int i, p, j;
    char num[5];

    hdr->ssid = 0;
    memset(hdr->addr, 0, sizeof(hdr->addr));
    memset(num, 0, sizeof(num));

    p = strpos(txt, '-');
    if (p > 0 && p < size) {
        for (i = 0; i < p && i < 6; i++) /* callsign/path */
            hdr->addr[i] = txt[i];

        j = 0;
        for (i = p + 1; i < size && j < sizeof(num) - 1; i++) { /* SSID */
            if (txt[i] < 0x30)
                break;
            if (txt[i] > 0x39)
                break;
            num[j++] = txt[i];
        }
        if (j > 0)
            hdr->ssid = (char)atoi(num);

        hdr->ssid <<= 1;
    } else {
        for (i = 0; i < size && i < 6; i++) {
            if (txt[i] == '*')
                break;
            if (txt[i] == ',')
                break;
            if (txt[i] == ':')
                break;
            hdr->addr[i] = txt[i];
        }
        hdr->ssid = 0;
    }
    p = strpos(txt, '*');
    if (p > 0 && p < size)
        hdr->ssid |= 0x80;
    hdr->ssid |= 0x60;
}

char ax25_encode(ax25_frame_t *frame, char *txt, int size) {
    char *token, *ptr;
    int i;
    unsigned int p, p2, p3;
    char j;

    memset(frame, 0, sizeof(ax25_frame_t));

